Tekla Open API Reference for Tekla Structures 2025
ReportTemplateElement Constructor
Overload List
Name | Description
ReportTemplateElement()
 Creates a new report template element instance with the default template.
ReportTemplateElement(TemplateInfo)
 Creates a new report template element instance with the given template.
Top
See Also
Reference
ReportTemplateElement Class
Tekla.Structures.Drawing Namespace